In [1]:
import pandas as pd
import numpy as np

In [2]:
sozluk = {"İstanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"İzmir":[40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozluk)

In [3]:
havaDurumuDataFrame

   İstanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [4]:
havaDurumuDataFrame.dropna()

   İstanbul  Ankara  İzmir
0      30.0    20.0     40

In [5]:
havaDurumuDataFrame.dropna(axis=1)

   İzmir
0     40
1     39
2     38

In [8]:
yeniVeri = {"İstanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"İzmir":[40,39,38],"Amtalya":[25,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [9]:
yeniDataFrame

   İstanbul  Ankara  İzmir  Amtalya
0      30.0    20.0     40     25.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [10]:
yeniDataFrame.dropna(axis = 1, thresh = 2) #Thres ile kaç tane NaN olmasını söylüyoruz.

   İstanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [11]:
yeniDataFrame

   İstanbul  Ankara  İzmir  Amtalya
0      30.0    20.0     40     25.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

yeniDataFrame.fillna(20) # Boş yerler 20 yerleştirdik.

## GroupBy

In [16]:
maasSozlugu = {"Departmanlar" : ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
              "Çalışan İsmi": ["Ahmet","Mehmet","Atıl","Burak","Zeynep","Fatma"],
               "Maaş": [100,150,200,300,400,500]
              }

In [17]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [18]:
maasDataFrame

  Departmanlar Çalışan İsmi  Maaş
0      Yazılım        Ahmet   100
1      Yazılım       Mehmet   150
2    Pazarlama         Atıl   200
3    Pazarlama        Burak   300
4        Hukuk       Zeynep   400
5        Hukuk        Fatma   500

In [20]:
grupObjesi = maasDataFrame.groupby("Departmanlar")

In [22]:
grupObjesi.count()

              Çalışan İsmi  Maaş
Departmanlar
Hukuk                    2     2
Pazarlama                2     2
Yazılım                  2     2

In [31]:
grupObjesi

In [27]:
grupObjesi.min()

             Çalışan İsmi  Maaş
Departmanlar
Hukuk               Fatma   400
Pazarlama            Atıl   200
Yazılım             Ahmet   100

In [28]:
grupObjesi.max()

             Çalışan İsmi  Maaş
Departmanlar
Hukuk              Zeynep   500
Pazarlama           Burak   300
Yazılım            Mehmet   150

In [29]:
grupObjesi.describe()

              Maaş
             count   mean        std    min    25%    50%    75%    max
Departmanlar
Hukuk          2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama      2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım        2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0